betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_cryp.c
      case DAL_CRYP_ERROR_CB_ID :
        hcryp->ErrorCallback = pCallback;
        break;

      case DAL_CRYP_MSPINIT_CB_ID :
        hcryp->MspInitCallback = pCallback;
        break;

      case DAL_CRYP_MSPDEINIT_CB_ID :
        hcryp->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hcryp->ErrorCode |= DAL_CRYP_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hcryp->State == DAL_CRYP_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_CRYP_MSPINIT_CB_ID :
        hcryp->MspInitCallback = pCallback;
        break;

      case DAL_CRYP_MSPDEINIT_CB_ID :
        hcryp->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hcryp->ErrorCode |= DAL_CRYP_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hcryp->ErrorCode |= DAL_CRYP_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hcryp);

  return status;
}

/**
  * @brief  Unregister an CRYP Callback
  *         CRYP callback is redirected to the weak predefined callback
  * @param hcryp cryp handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_CRYP_INPUT_COMPLETE_CB_ID Input FIFO transfer completed callback ID
  *          @arg @ref DAL_CRYP_OUTPUT_COMPLETE_CB_ID Output FIFO transfer completed callback ID
  *          @arg @ref DAL_CRYP_ERROR_CB_ID Error callback ID
  *          @arg @ref DAL_CRYP_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref DAL_CRYP_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_CRYP_UnRegisterCallback(CRYP_HandleTypeDef *hcryp, DAL_CRYP_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hcryp);

  if (hcryp->State == DAL_CRYP_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_CRYP_INPUT_COMPLETE_CB_ID :
        hcryp->InCpltCallback = DAL_CRYP_InCpltCallback;  /* Legacy weak  InCpltCallback  */
        break;

      case DAL_CRYP_OUTPUT_COMPLETE_CB_ID :
        hcryp->OutCpltCallback = DAL_CRYP_OutCpltCallback;         /* Legacy weak OutCpltCallback       */
        break;

      case DAL_CRYP_ERROR_CB_ID :
        hcryp->ErrorCallback = DAL_CRYP_ErrorCallback;           /* Legacy weak ErrorCallback        */
        break;

      case DAL_CRYP_MSPINIT_CB_ID :
        hcryp->MspInitCallback = DAL_CRYP_MspInit;
        break;

      case DAL_CRYP_MSPDEINIT_CB_ID :
        hcryp->MspDeInitCallback = DAL_CRYP_MspDeInit;
        break;

      default :
        /* Update the error code */
        hcryp->ErrorCode |= DAL_CRYP_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hcryp->State == DAL_CRYP_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_CRYP_MSPINIT_CB_ID :
        hcryp->MspInitCallback = DAL_CRYP_MspInit;
        break;

      case DAL_CRYP_MSPDEINIT_CB_ID :
        hcryp->MspDeInitCallback = DAL_CRYP_MspDeInit;
        break;

      default :
        /* Update the error code */
        hcryp->ErrorCode |= DAL_CRYP_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hcryp->ErrorCode |= DAL_CRYP_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hcryp);

  return status;
}
#endif /* USE_DAL_UART_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup CRYP_Exported_Functions_Group2  Encrypt Decrypt functions
  *  @brief   processing functions.
  *
@verbatim
  ==============================================================================
                      ##### Encrypt Decrypt  functions #####
  ==============================================================================
    [..]  This section provides API allowing to Encrypt/Decrypt Data following
          Standard DES/TDES or AES, and Algorithm configured by the user:
      (+) Standard DES/TDES only supported by CRYP1 IP, below list of Algorithm supported :
           - Electronic Code Book(ECB)
           - Cipher Block Chaining (CBC)
      (+) Standard AES  supported by CRYP1 IP & TinyAES, list of Algorithm supported:
           - Electronic Code Book(ECB)
           - Cipher Block Chaining (CBC)
           - Counter mode (CTR)
           - Cipher Block Chaining (CBC)
           - Counter mode (CTR)
           - Galois/counter mode (GCM)
           - Counter with Cipher Block Chaining-Message(CCM)
    [..]  Three processing functions are available:
      (+) Polling mode : DAL_CRYP_Encrypt & DAL_CRYP_Decrypt
      (+) Interrupt mode : DAL_CRYP_Encrypt_IT & DAL_CRYP_Decrypt_IT
      (+) DMA mode : DAL_CRYP_Encrypt_DMA & DAL_CRYP_Decrypt_DMA

@endverbatim
  * @{
  */


/**
  * @brief  Encryption mode.
  * @param  hcryp: pointer to a CRYP_HandleTypeDef structure that contains
  *         the configuration information for CRYP module
  * @param  Input: Pointer to the input buffer (plaintext)
  * @param  Size: Length of the plaintext buffer in word.
  * @param  Output: Pointer to the output buffer(ciphertext)
  * @param  Timeout: Specify Timeout value
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CRYP_Encrypt(CRYP_HandleTypeDef *hcryp, uint32_t *Input, uint16_t Size, uint32_t *Output,
                                   uint32_t Timeout)
{
  uint32_t algo;
  DAL_StatusTypeDef status;

  if (hcryp->State == DAL_CRYP_STATE_READY)
  {
    /* Change state Busy */
    hcryp->State = DAL_CRYP_STATE_BUSY;

    /* Process locked */
    __DAL_LOCK(hcryp);

    /*  Reset CrypInCount, CrypOutCount and Initialize pCrypInBuffPtr and pCrypOutBuffPtr parameters*/
    hcryp->CrypInCount = 0U;
    hcryp->CrypOutCount = 0U;
    hcryp->pCrypInBuffPtr = Input;
    hcryp->pCrypOutBuffPtr = Output;

    /*  Calculate Size parameter in Byte*/
    if (hcryp->Init.DataWidthUnit == CRYP_DATAWIDTHUNIT_WORD)
    {
      hcryp->Size = Size * 4U;
    }
    else
    {
      hcryp->Size = Size;
    }

#if defined (CRYP)
    /* Set Encryption operating mode*/
    MODIFY_REG(hcryp->Instance->CTRL, CRYP_CTRL_ALGODIRSEL, CRYP_OPERATINGMODE_ENCRYPT);

    /* algo get algorithm selected */
    algo = hcryp->Instance->CTRL & CRYP_CTRL_ALGOMSEL;

    switch (algo)
    {
      case CRYP_DES_ECB:
      case CRYP_DES_CBC:
      case CRYP_TDES_ECB:
      case CRYP_TDES_CBC:

        /*Set Key */
        hcryp->Instance->K1L = *(uint32_t *)(hcryp->Init.pKey);
        hcryp->Instance->K1R = *(uint32_t *)(hcryp->Init.pKey + 1);
        if ((hcryp->Init.Algorithm == CRYP_TDES_ECB) || (hcryp->Init.Algorithm == CRYP_TDES_CBC))
        {
          hcryp->Instance->K2L = *(uint32_t *)(hcryp->Init.pKey + 2);
          hcryp->Instance->K2R = *(uint32_t *)(hcryp->Init.pKey + 3);
          hcryp->Instance->K3L = *(uint32_t *)(hcryp->Init.pKey + 4);
          hcryp->Instance->K3R = *(uint32_t *)(hcryp->Init.pKey + 5);
        }

